"""
Дан словарь, создать новый словарь при помощи конструкции генератор словаря,
поменяв местами ключ и значение.
"""

slovar = {'a': 45, '34': 'cc', 56: (2, 3, 4)}
new_slovar = dict([[slovar[i], i] for i in slovar])

print(new_slovar)
